In [3]:
import numpy as np
import pandas as pd

In [4]:
lables = ["a","b","c"]
my_list = [10,20,30]
arr = np.array([10,20,30])
dic = {1:10,2:20,3:30}

In [5]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(my_list,index=lables)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(dic)

1    10
2    20
3    30
dtype: int64

In [9]:
data = {
    "Name": ["jonny", "Anna","Rahul", "krishna"],
    "Age": [23,45,34,24],
    "City": ["Delhi","Mumbhai","Banglore","New york"],
    "Salary": [65000,4500,7800,45820]
}

In [10]:
df2 = pd.DataFrame(data)
print(df2)

      Name  Age      City  Salary
0    jonny   23     Delhi   65000
1     Anna   45   Mumbhai    4500
2    Rahul   34  Banglore    7800
3  krishna   24  New york   45820

In [11]:
dataa = [
    ["john", 24, "New york", 65412],
    ["Noman", 38, "USA", 78400],
    ["Dennis Retchie", 90, "South africa", 45000]
    
]

In [12]:
pd.DataFrame(dataa)
coloum = ["Name","Age","City","Salary"]
pd.DataFrame(dataa,columns=coloum)

             Name  Age          City  Salary
0            john   24      New york   65412
1           Noman   38           USA   78400
2  Dennis Retchie   90  South africa   45000

In [13]:
new_data = {
    "Name" : ["Sohan", "Krishana", "Dev", "Rohit"],
    "Age" :  [23, 54, 34, 35],
    "City" : ["Delhi","Gurjrat", "Pune", "Usa"],
    "Salary" : [4500, 4586, 1245, 6963]
}

In [14]:
df = pd.DataFrame(new_data)
print(df)

       Name  Age     City  Salary
0     Sohan   23    Delhi    4500
1  Krishana   54  Gurjrat    4586
2       Dev   34     Pune    1245
3     Rohit   35      Usa    6963

In [15]:
df[["Name","City","Age"]]

       Name     City  Age
0     Sohan    Delhi   23
1  Krishana  Gurjrat   54
2       Dev     Pune   34
3     Rohit      Usa   35

In [16]:
df["Designation"] = ["Doctor","Engineer","Professor","civil Engineer"]

In [17]:
df

       Name  Age     City  Salary     Designation
0     Sohan   23    Delhi    4500          Doctor
1  Krishana   54  Gurjrat    4586        Engineer
2       Dev   34     Pune    1245       Professor
3     Rohit   35      Usa    6963  civil Engineer

In [18]:
df2

      Name  Age      City  Salary
0    jonny   23     Delhi   65000
1     Anna   45   Mumbhai    4500
2    Rahul   34  Banglore    7800
3  krishna   24  New york   45820

In [40]:
df2 ["Work Experience"] = [8,6,2,6]

In [54]:
df2

   Age  Work Experience
0   23                8
1   45                6
2   34                2
3   24                6

In [42]:
#df2[['Name',"City","Age"]]

In [53]:
df2

   Age  Work Experience
0   23                8
1   45                6
2   34                2
3   24                6

In [59]:
df2.drop("Name",axis = 1, inplace=True)  #this work function parmanent delet coloum

In [60]:
df2

   Age  Work Experience
0   23                8
1   45                6
2   34                2
3   24                6

In [56]:
df

       Name  Age     City  Salary     Designation
0     Sohan   23    Delhi    4500          Doctor
1  Krishana   54  Gurjrat    4586        Engineer
2       Dev   34     Pune    1245       Professor
3     Rohit   35      Usa    6963  civil Engineer

In [64]:
df.drop(0,axis = 0) # removing a row

       Name  Age     City  Salary
1  Krishana   54  Gurjrat    4586
2       Dev   34     Pune    1245
3     Rohit   35      Usa    6963

In [65]:
df

       Name  Age     City  Salary
0     Sohan   23    Delhi    4500
1  Krishana   54  Gurjrat    4586
2       Dev   34     Pune    1245
3     Rohit   35      Usa    6963

Selecting Rows

In [67]:
df

       Name  Age     City  Salary
0     Sohan   23    Delhi    4500
1  Krishana   54  Gurjrat    4586
2       Dev   34     Pune    1245
3     Rohit   35      Usa    6963

In [69]:
df.loc[[0,1]]

       Name  Age     City  Salary
0     Sohan   23    Delhi    4500
1  Krishana   54  Gurjrat    4586

selecting subsets of rows abd columns

In [70]:
df.loc[[0,1]] [["City","Salary"]]

      City  Salary
0    Delhi    4500
1  Gurjrat    4586

In [76]:
df.loc[[1,2]] [["Name","Age"]]

       Name  Age
1  Krishana   54
2       Dev   34

Conditionl selection

In [77]:
df

       Name  Age     City  Salary
0     Sohan   23    Delhi    4500
1  Krishana   54  Gurjrat    4586
2       Dev   34     Pune    1245
3     Rohit   35      Usa    6963

In [78]:
df[df["Age"] > 30]

       Name  Age     City  Salary
1  Krishana   54  Gurjrat    4586
2       Dev   34     Pune    1245
3     Rohit   35      Usa    6963

In [82]:
df[(df["Age"] >30) & (df["City"] == "Pune")]

  Name  Age  City  Salary
2  Dev   34  Pune    1245